src/cf/Catalogs/ИдентификаторыПроизводственныхТранзакцийБПВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыПроизводственныхТранзакцийБПВЕТИС</Name>
			<Comment>Служебный</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаТранзакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ИдентификаторыПроизводственныхТранзакцийБПВЕТИС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Параметры.Свойство("Основание") И Параметры.Основание <> Неопределено Тогда
			Объект.ДатаНачалаТранзакции = Параметры.Основание.Дата;
			Объект.Наименование 		= СформироватьНаименование(Параметры.Основание.ДокументОснование);
			Объект.Предприятие 			= Параметры.Основание.Предприятие;
			Объект.ХозяйствующийСубъект = Параметры.Основание.ХозяйствующийСубъект;
		Иначе
			Объект.ДатаНачалаТранзакции = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаименование(Основание)
	Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Основание.Номер, Истина, Истина);
	Дополнение = "";
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		Дополнение = Основание.ЦельРасхода.Наименование;
	КонецЕсли;
	Возврат "№ "+Номер+" от "+Формат(Основание.Дата,"ДЛФ=Д")+?(ЗначениеЗаполнено(Дополнение),": "+ Дополнение,"");
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаТранзакции) Тогда
		Объект.ДатаНачалаТранзакции = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СозданаНоваяПроизводственнаяТранзакция");
	
КонецПроцедуры
